In [11]:
import pandas as pd
import numpy as np

In [12]:
#To read a Datasets
df1 = pd.read_csv('data/groupby_example.csv')

In [13]:
df1

  Gender  height
0      m     172
1      f     171
2      f     169
3      m     173
4      f     170
5      m     175
6      m     178

In [14]:
# traditional ways 
# Split
maleData = df1.Gender=='m'
femaleData = df1['Gender']=='f'

In [16]:
#step 2 - find the mean
# Apply - mean , mode*), median, max, count(), var 
mMean =df1[maleData]['height'].mean()
mMean

174.5

In [17]:
fMean =df1[femaleData]['height'].mean()
fMean

170.0

In [20]:
# To show the results in a DataFrame
# combined
newDataFrame = pd.DataFrame(
{
    'Gender':['M','F'],
    'Averageheight':[mMean,fMean]
})

In [21]:
newDataFrame

  Gender  Averageheight
0      M          174.5
1      F          170.0

In [24]:
# - split, apply and combine 
df1.groupby('Gender').mean()

        height
Gender
f        170.0
m        174.5

In [25]:
df1.groupby('Gender').max()

        height
Gender
f          171
m          178

In [26]:
df1.groupby('Gender').count()

        height
Gender
f            3
m            4

In [27]:
df1.groupby('Gender').min()

        height
Gender
f          169
m          172